{"id":20267,"date":"2019-11-15T04:00:07","date_gmt":"2019-11-15T04:00:07","guid":{"rendered":"https:\/\/acecharityafrica.org\/kayodes-interview-2\/"},"modified":"2019-11-15T04:00:07","modified_gmt":"2019-11-15T04:00:07","slug":"what-does-it-truly-mean-to-be-fulfilled","status":"publish","type":"post","link":"https:\/\/acecharityafrica.org\/2019\/11\/15\/what-does-it-truly-mean-to-be-fulfilled\/","title":{"rendered":"What Does it Truly Mean to be Fulfilled?"},"content":{"rendered":"\n<p>Fulfillment they say is a feeling of achieving what you have always dreamed of,&nbsp; it is a true sense of purpose!<\/p>\n\n\n\n<p>Here is what Hadiza Jibril, a Beneficiary of the Business Empowerment Programme (BEPW5) says about fulfillment and how this programme is helping her achieve it.<\/p>\n\n\n\n<p><br><strong>What inspired you to enroll for the BEPW5?<\/strong><br>My inspiration came from my desire to become a fashion designer. It was just a dream before I saw this opportunity on Facebook. I decided to try it and I was selected out of a lot of people.<\/p>\n\n\n\n<p><br><strong>What has your experience been like during the Program?<\/strong><br>It has been good. I will not say I really had issues from the beginning. I blended well with my co-beneficiaries and we have good teachers.  I am happy with the teachers given: a male and female teacher. The male teacher teaches us how to make male wears and the female handles the female attires.<\/p>\n\n\n\n<p>The food is amazing. Transcorp Hilton provides us with lunch every afternoon and we also have all the materials we need to learn &#8211; discarded linens to cut all different designs.&nbsp; We have the fashion Illustration class which I really like and I would say I am one of the best of the four (laughs). I now make beautiful designs, I draw fine sketches on my own and it has been nice. Also, our Business class has been amazing. Transcorp Hilton staff from sales and account department respectively, have taught us how to relate to our customers and how to keep them so they do not leave after sewing with us just once. I would say my experience has been good so far and&nbsp; I am happy I have learnt alot. Transcorp Hilton and ACE Charity have been simply amazing. Thank you so much.<\/p>\n\n\n\n<p><br><strong>Who do you aspire to be like in the fashion industry?<\/strong><br>I would say Hudayya . She is a good fashion designer. I love her designs and would like to follow that path. I love modest fashion which she does, and I would like to further in that area.<\/p>\n\n\n\n<p><br><strong>With this program, do you feel any sense of fulfillment? Do you think it is helping you move closer to your dreams?<\/strong><br>Yes, it has. In so many ways. Even potentials I never thought I had. It has opened us to the realization that I could do a lot and not just settle for little. I could go big. This platform has opened my eyes to realize that I can achieve my dreams of being successful in the fashion industry.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fulfillment they say is a feeling of achieving what you have always dreamed of,&nbsp; it is a true sense of purpose! Here is what Hadiza Jibril, a Beneficiary of the Business Empowerment Programme (BEPW5) says about fulfillment and how this programme is helping her achieve it. What inspired you to enroll for the BEPW5?My inspiration [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":659,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14],"tags":[],"class_list":["post-20267","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-articles"],"_links":{"self":[{"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/posts\/20267","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/comments?post=20267"}],"version-history":[{"count":0,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/posts\/20267\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/media\/659"}],"wp:attachment":[{"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/media?parent=20267"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/categories?post=20267"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/acecharityafrica.org\/wp-json\/wp\/v2\/tags?post=20267"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}